# RbsSection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsSection Property
ParameterTypeId Class See Also
---
"Section"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsSection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsSection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsSection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace